#SOS το tap εδω ειναι typed argument parser και ουσιαστικα οριζω κλασεις πχ με args = SimulationArgs() και μετα args.display 
# θα βγαλει η python αυτοματα οτι εινια bool και θα βαλω true ή false ανάλογα με τι τι θέλω.
#Ετσι μπορω να αλλαξω παραμετρικα πριν τρεξω την προσομοιωση καποιες παραμετρους δυναμικα καθε φορα που θα αλλαζω το args.κατι,
#  Θα γραφω args. και κατι απο τη λιστα και να δεν βαζω τοτε θα παιρνει σαν προεπιλογη αυτο που εχει στην κλαση  

import tap


class SimulationArgs(tap.Tap):
    num_repetitions: int = 1 #ποσες φορες θα τρεξει την ιδια προσομοιωση με τις ιδιες αρχικες συνθηκες κυριως για μετρησεις benchmarking
    display: bool = False #Αν θα φαινεται η προσομοιωση σε καποιο γραφικο περιβαλλον εδω Meshcat
    display_com: bool = False #Αν θα εμφανιζει το κεντρο μαζας (com) στο viewer
    debug: bool = False #Οταν ειναι True ενεργοποιει το debug mode. Ουσιαστικα ενεργοποιει αυτοματα μερικα diplay flags και το πιο συχνο output για να βλεπεις τι γινεται 
    debug_step: int = 1 # Καθε ποσα βηματα steps θα κανει debug print/plots (εδω ειναι 1)
    display_collision_model: bool = False #Αν θα εμφανιζει τα collision meshes αντι για τα visual
    display_step: bool = False #Αν θα εμφανιζει τον αριθμο βηματος
    display_state: bool = False #Αν θα τυπωνει κατασταση x,v,energies
    display_contacts: bool = False # Αν θα εμφανιζει τα σημεια επαφης εφοσον υποστηριζεται απο το simulation_args
    debug_transparency: float = 0.5 #Διαφανεια των επιφανειων στο debug viewr για να βλεπω μεσα απο τα links του ρομποτ 
    max_fps: int = 120 #οριο fps για το visualization για να μην τρεχει υπερβολικα γρηγρα το visualization
    Kp: float = 0  # baumgarte proportional term διορθωτικος ορος για θεση. Πρόσθεση αναλογικου όρου σφαλματος θεσης 
    Kd: float = 0  # baumgarte derivative term διορθβτικος ορος για ταχυτητα. Πρόσθεση αναλογικου όρου σφαλματος ταχυτητας
    compliance: float = 0 #μαλακότητα επαφης. Οσο πιο κοντα στο 0 εινια τοσο πιο ακαμπτη επαφη θα ειναι. Οσο μεγαλωνει τοσο θα ειναι σαν γομα/αλατηριο
    material: str = "metal" # Εχω επιλογες για το ειδους του υλικου ice/ plastic/ wood/ metal/ concrete συνηθως επηρεαζει τον συντελεστη τριβης
    horizon: int = 1000 #Ο όρος "horizon" συνήθως δεν αφορά τον ίδιο τον contact solver, αλλά τον αλγόριθμο ελέγχου 
    #(όπως το Reinforcement Learning ή το Model Predictive Control - MPC) που χρησιμοποιεί την προσομοίωση. 
    # Είναι το πόσα βήματα στο μέλλον κοιτάει το πρόγραμμά σου για να πάρει μια απόφαση. 
    # Αν το horizon είναι 50, σημαίνει ότι το πρόγραμμα θέλει να προβλέψει τι θα γίνει στα επόμενα 50 βήματα (dt) πριν αποφασίσει τι θα κάνει 
    dt: float = 1e-3 #Χρονικο βημα ολοκληρωσης. Οσο πιο μικρο τοσο πιο σταθερο αλλα πιο αργο. Διακριτοποιηση του χρονου ουσιαστικα. αμα dt=0.01, ο επιλυτης υπολογιζει δυναμεις κλπ και τη νεα θεση αντικειμενων για 0.01 δευτερολεπτα μπροστα σο χρονο
    tol: float = 1e-6 #Ολικη ανοχη συγκλισης για τον επιλυτη επαφων/constaints ADMM/PGS. Οσο μικροτερη τοσο πιο αυστηρο αρα περισσοτερες επαναληψεις
    tol_rel: float = 1e-6 #Σχετική ανοχη συγκλισης για τον επιλυτη επαφων/constaints ADMM/PGS. 
    mu_prox: float = 1e-4 #Παραμετρος proximal/regularization στον ADMM ή σε proximal updates. 
    #Επηρεαζει σταθεροτητα και ταχυτητα συγκλισης.
    maxit: int = 1000 #Μεγιστος αριθμος iterations του solver ανα step (κυριως ADMM). Όταν δύο αντικείμενα ακουμπάνε 
    #(π.χ. το πόδι ενός ρομπότ στο πάτωμα), ο contact solver πρέπει να βρει ακριβώς πόση δύναμη χρειάζεται για να μην 
    # βουλιάξει το πόδι μέσα στο πάτωμα (non-penetration constraint) και για να μην γλιστρήσει (friction). 
    # Αυτά τα μαθηματικά είναι πολύ δύσκολο να λυθούν τέλεια με τη μία. Γι' αυτό, ο solver κάνει μαντεψιές που τις 
    # διορθώνει συνεχώς (iterative approach).Τα iterations είναι το πόσες φορές θα προσπαθήσει ο solver να 
    # "τελειοποιήσει" τη λύση του μέσα σε ένα και μόνο dt.
    warm_start: int = 1 #Αυτό συνδέεται άμεσα με τα iterations που λέγαμε πριν! Σκέψου το εξής: σε κάθε dt, το ρομπότ/αντικείμενο κινείται ελάχιστα. Αντί ο solver να προσπαθεί να μαντέψει τις δυνάμεις επαφής από το μηδέν σε κάθε βήμα, το warm_start του λέει: "Χρησιμοποίησε τη λύση που βρήκες στο προηγούμενο χιλιοστό του δευτερολέπτου ως αρχική μαντεψιά". Αυτό μειώνει δραματικά τα iterations που χρειάζεται.
    contact_solver: str = "ADMM" # το ειδος του contact solver οι επιλογες εινια ADMM (Alternating Direction Method of Multipliers) είναι πιο σύγχρονος και μαθηματικά πιο "στιβαρός" αλλα πιο βαρυς  ή PGS (Projected Gauss-Seidel) είναι ο παραδοσιακός, κλασικός αλγόριθμος. Λύνει τις επαφές μία-μία με τη σειρά.
    plot_metrics: bool = False # Αν ζωγραφιστούν γραφήματα (plots) στο τέλος (π.χ. ταχύτητα σε σχέση με το χρόνο, σφάλμα solver, κλπ).
    plot_hist: bool = False #Αν θα παραχθούν ιστογράμματα (π.χ. κατανομή των δυνάμεων επαφής).
    plot_title: str = "NO TITLE" #Ο τίτλος που θα μπει πάνω-πάνω σε αυτά τα γραφήματα, αν τα ενεργοποιήσεις.
    seed: int = 1234 #Οι υπολογιστές παράγουν "ψευδο-τυχαίους" αριθμούς. Ορίζοντας το seed στο 1234, διασφαλίζεις ότι αν τρέξεις το πείραμα 10 φορές, το "τυχαίο" θα είναι ακριβώς το ίδιο και τις 10 φορές
    random_initial_velocity: bool = False #Αν ήταν True, κάθε φορά που ξεκινούσε το simulation, τα αντικείμενα/ρομπότ θα είχαν μια τυχαία αρχική ταχύτητα (ώθηση)
    add_damping: bool = False # Δρα σαν αεροδυναμική αντίσταση ή σαν εσωτερική τριβή στις αρθρώσεις, αφαιρώντας ενέργεια από το σύστημα για να ηρεμεί. 
    damping_factor: float = 0.0 #Αν το simulation σου "εκρήγνυται" (τα αντικείμενα εκτινάσσονται στο άπειρο, ένα κλασικό bug των physics engines), το να βάλεις λίγο damping βοηθάει στη σταθερότητα
    admm_update_rule: str = "spectral" # Ο ADMM έχει μια εσωτερική παράμετρο (ένα "βήμα" τιμωρίας) που πρέπει να ρυθμίζεται. Η μέθοδος "spectral" είναι ένας έξυπνος μαθηματικός τρόπος για να προσαρμόζει ο αλγόριθμος αυτή την παράμετρο δυναμικά, ώστε να βρίσκει τη λύση (να συγκλίνει) με λιγότερα iterations. Υπάρχει και επιλογή για linear 
    mujoco_show_ui: bool = False #Οταν ανοιξει το mujoco να εχει sliders διπλα για να πειραμαιζεσαι
    max_patch_size: int = 4 #Όταν ένα κουτί ακουμπάει στο πάτωμα, θεωρητικά υπάρχουν άπειρα σημεία επαφής. Ο solver τα ομαδοποιεί σε "patches" (περιοχές επαφής) για να μην κρασάρει ο υπολογιστής. Εδώ του λες ότι ένα patch μπορεί να έχει μέχρι 4 σημεία επαφής το πολύ,
    patch_tolerance: float = 1e-3# αν δύο σημεία απέχουν λιγότερο από 1e-3 (χιλιοστά), θεώρησέ τα ως ένα κοινό σημείο.

    # --- ΠΡΟΣΘΗΚΕΣ ΑΠΟ ΤΟ sim_utils.py ΓΙΑ ΝΑ ΜΗΝ ΧΤΥΠΑΕΙ Ο SOLVER ---
    solve_ccp: bool = False #οσο ειναι false ο επιλυτηε επαφων λυνει το πτοβλημα σαν rigid bodies αλλα αν γινει True τοτε τα κομματια του ρρομποτ γινονται κυρτες επιφανειες που ισως λυνουν το προβλημα πιο γρηγορα αλλα δεν εινια τοσο ακτιβεις
    max_contacts_per_pair: int = 4 # το ιδιο με max_patch size
    ratio_primal_dual: float = 1.0 #δες σχολιο στο κατω μερος του αρχειου αυτου
    tau: float = 1.0 #εινια το μηκος βηματος ποσο μεγαλα βηματα κανει ο αλγοριθμος προς την βελτιστη λυση
    rho: float = 0.05 # το πεναλτι που εφαρμοζει ο αλγοριθμος. οσο πιο μικρο εινια τοσο πιο χαλαρος εινια ο αλγοριθμος με αποτελσμα να χρειαζεατι περισσοτερες iterations, αλλα αν εινα μεγαλο δεν συγκλινει ποτε ο αλγοριθμος
    rho_power: float = 0.05 #βαρη για να υπολογιστει το νεο rho
    rho_power_factor: float = 0.05#ομοιως
    lanczos_size: int = 3 #το ποσα διανυσματα θα χρησιμοποιησει για να βρει νεα εκτιμηση του rho (ιδιοδιανυσματα ιδιοτιμες)
    linear_update_rule_factor: float = 2.0
    # -----------------------------------------------------------------

    def process_args(self):
        if self.debug: # Αμα ειναι True το debug απο πανω τοτε θα γινεουν True και τα παρκατω 
            self.display = True
            self.display_contacts = True
            self.display_state = True
            self.display_com = True


class ControlArgs(SimulationArgs): #αυτη η κλαση κληρονομει ολα τα παραπανω και προσθετει τα παρακατω . Εινια κυριως για λεεγχο
    noise_scale: float = 5.0 #κλιμακα θορυβου στον controller η στα observations
    nnodes: int = 10  # nnodes = horizon // nsteps # Πληθος control nodes στον horizon
    tau_max: float = 20.0 #μεγιστη ροπη
    wtau: float = 1e-4 #βαρος στην ποινη ροπης στο cost function
    wtarget: float = 5.0 #βαρος στο κοστος θεσης/pose να φτασει καποθ
    wvel: float = 1.0 #βαρος στο cost για ταχυτητες (για να μειωθουν ισως oscillations)
    Nsim: int = 25 #Ποσες προσομοιωσεις θα τρεξει σε ενα simulation loop
    max_fevals: int = 1e4 # Μεγιστος αριθμος function evaluations για optimizer
    use_max_fevals: int = 1 #flags 0/1 αν θα εφαρμοσει το max_fevals ως stopping criterion



'''
Ο Συνολικός Χρόνος Πρόβλεψης: Ορίζεται από το γινόμενο horizon * dt. Αν το horizon είναι 100 βήματα και το dt είναι 0.01 δευτερόλεπτα, τότε ο αλγόριθμός σου κοιτάει 1 δευτερόλεπτο μπροστά στο μέλλον.

Ο Υπολογιστικός Φόρτος (Πόσο βαριά είναι η προσομοίωση): Για να υπολογίσει τον ορίζοντα των 100 βημάτων, ο contact solver πρέπει να κληθεί 100 φορές. Σε κάθε μία από αυτές τις φορές, θα εκτελέσει π.χ. 20 iterations για να βεβαιωθεί ότι οι επαφές είναι ρεαλιστικές.

Το "Τρίγωνο" των Αποφάσεων: * Αν θες μεγάλη ακρίβεια στις συγκρούσεις, μειώνεις το dt (π.χ. στο 0.001) και αυξάνεις τα iterations.

Όμως, επειδή τώρα το dt είναι μικρότερο, το ρομπότ σου προχωράει λιγότερο χρόνο σε κάθε βήμα. Για να συνεχίσει να "βλέπει" 1 δευτερόλεπτο στο μέλλον, θα πρέπει να αυξήσεις δραματικά το horizon (από 100 στο 1000).
Α
υτό πολλαπλασιάζει τους υπολογισμούς και κάνει το simulation πολύ αργό.

Συνοπτικά: Το dt είναι το "βήμα" του χρόνου, τα iterations είναι ο "κόπος" που ρίχνει ο solver σε κάθε βήμα για να μην βουλιάζουν τα αντικείμενα, και το horizon είναι το πόσα "βήματα" μπροστά σχεδιάζει το πείραμά σου.

'''

'''
Ο αλγόριθμος ADMM, σε κάθε iteration, μετράει δύο διαφορετικά είδη "σφαλμάτων" (λαθών) για να δει πόσο κοντά είναι στη λύση:

Primal Residual (Πρωτεύον Σφάλμα): Αφορά τη γεωμετρία/κίνηση. π.χ. "Τα δάχτυλα έχουν μπει το ένα μέσα στο άλλο κατά 0.1 χιλιοστά"

Dual Residual (Δυϊκό Σφάλμα): Αφορά τις δυνάμεις. π.χ. "Οι δυνάμεις που βρήκα δεν ισορροπούν τέλεια το σύστημα ή παραβιάζουν τον νόμο της τριβής".

Ο στόχος του ADMM είναι να κάνει και τα δύο αυτά λάθη μηδέν. Όμως, συχνά το ένα λάθος μικραίνει πολύ γρήγορα και το άλλο μένει στάσιμο.

Εδώ μπαίνει το ratio_primal_dual = 10.0: Λέει στον αλγόριθμο: "Προσπάθησε να κρατάς μια ισορροπία. Αν δεις ότι το Πρωτεύον σφάλμα γίνει 10 φορές μεγαλύτερο από το Δυϊκό (ή το αντίστροφο), τότε άλλαξε δυναμικά το rho (εκείνο το βήμα ποινής που λέγαμε) για να ρίξεις το βάρος στο λάθος που έχει ξεφύγει".
'''